/*
* 描述
* 牛牛尝试用键盘读入一个字符，然后在屏幕上显示一个用这个字符填充的对角线长5个字符，倾斜放置的菱形。
* 输入描述：
* 输入一个char类型字符
* 输出描述：
* 输出一个用这个字符填充的对角线长5个字符，倾斜放置的菱形
* 示例1
* 输入：
* #
* 输出：
*  #
* ###
*#####
* ###
*  #
*/
#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

int main()
{
	char ch = 0;
	int i = 0, j = 0;

	ch = getchar();	/*输入单个字符*/

	/*先输出正三角形*/
	for (i = 0; i <= 2; i++)	/*控制输出的行数*/
	{
		for (j = 3; j > (i + 1); j--)
		{
			putchar(' ');	/*输出空格符*/
		}
		
		for (j = 0; j <= (i * 2); j++)	/*控制一行输出字符的个数*/
		{
			putchar(ch);	/*输出单个字符*/
		}
		putchar('\n');	/*输出换行符*/
	}

	/*再输出倒三角形*/
	for (i = 1; i >= 0; i--)	/*控制输出的行数*/
	{
		for (j = 3; j > (i + 1); j--)
		{
			putchar(' ');	/*输出空格符*/
		}

		for (j = 0; j <= (i * 2); j++)	/*控制一行输出字符的个数*/
		{
			putchar(ch);	/*输出单个字符*/
		}
		putchar('\n');	/*输出换行符*/
	}

	return 0;
}
